# 🚀 System Deployment Commands

HOSTNAME ?= $(shell hostname)

# All targets now depend on imports.nix
switch: markers
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@echo "> ⚡ Applying system configuration to .#$(HOSTNAME)..."
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@sudo nixos-rebuild switch --flake .#$(HOSTNAME)

build: markers
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@echo "> ⚙️ Building configuration to ./result for .#$(HOSTNAME)..."
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@sudo nixos-rebuild build --flake .#$(HOSTNAME)

boot: markers
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@echo "> 🚀 Building configuration for next boot for .#$(HOSTNAME)..."
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@sudo nixos-rebuild boot --flake .#$(HOSTNAME)

clean:
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@echo "> 🧹 Cleaning up old generations..."
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@sudo nix-collect-garbage --delete-older-than 5d

# 🎨 Code Formatting Commands

fmt:
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@echo "> 🎨 Formatting nix files..."
	@echo "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━"
	@nixfmt "**/*.nix"

markers:
	@changed_files=$$(./utils/markers.sh); \
	if [ -n "$$changed_files" ]; then \
	  echo "$$changed_files" | xargs git add; \
	fi
